app/controllers/students_controller.rb

    def index
        @student = Student.all
---
SELECT "students".* FROM "students"

    def create
        @student = Student.create(student_params)
---
INSERT INTO "students" ("first_name", "last_name", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["first_name", "Sam"], ["last_name", "Smith"], ["created_at", "2020-10-09 15:21:51.243335"], ["updated_at", "2020-10-09 15:21:51.243335"]]

    def update
        @student = Student.find(params[:id])
        @student.update(student_params)
---
SELECT  "students".* FROM "students" WHERE "students"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "students" SET "first_name" = ?, "updated_at" = ? WHERE "students"."id" = ?  [["first_name", "Sammy"], ["updated_at", "2020-10-09 15:23:04.162016"], ["id", 3]]